# APTP 2022 - **LearnMe**
###### Asterisk Python Team Project 2022
구성원: 강찬수 | 김진석 | 박성호 | 진성욱 | 최연우

## 1. 주제
런어스 보조 프로그램

## 2. 동기
평상시에 런어스를 사용하면서 여러 가지로 구성이 불편하고 새로 업데이트 됐을 때 가시성과 알림 기능이 좋지 않아서 동영상 시청을 까먹는 등 낭패를 본 적이 한 두번이 아니고 그러다보니 맨날 뭐 빠진 거 있나 확인하게 되는데 너무 힘들어서 이 주제를 생각하게 되었습니다.

## 3. 프로그램 사용 대상
연세대학교 런어스를 사용하는 학생, 교직원들

## 4. 목적
런어스에서 무언가 빠트린게 없도록 런어스에서 정보를 가져오는 것

## 5. 주요기능
1. 프로그램에서 업데이트 누르기 전과 새로 업데이트 된 영상, 과제, 공지사항 등을 좀 영상 시청, 과제 제출 기간 같이 자세하게 표시
2. 과제 제출, 영상 시청 여부 
3. 런어스 달력보다 가시성 있고 쓸만한 달력 기능?
4. 새 영상 업데이트시 자동 재생, 출석
5. 추후 추가 예정...!
6. 

## 6. 프로젝트 핵심
1. 첫번째 핵심: 프로그램을 켰을 때 본인의 학번과 비밀번호를 적으면 런어스 홈페이지에 로그인하는 것
2. 두번째 핵심: 프로그램을 전에 실행했을 때 저장한 내용과 후에 실행했을 때 런어스에서의 내용을 비교해서
               새로 업데이트된 내용을 알아내는 것
3. 세번째 핵심: 주요 기능을 구현할 수 있게 하는 것
4. 네번째 핵심: 가시성이 좋게 UI를 만드는 것

## 7. 구현에 필요한 라이브러리나 기술
requests, beautifulsoup, urljoin, load_dotenv, os 등등 추후 추가 에쩡

## 8. **분업 계획**
강찬수: 총괄 

김진석: 미정 

박성호: 미정 

진성욱: 미정 

최연우: 미정 


## 9. 기타

1. 성공적으로 프로젝트가 마무리된다면 시반공 학생들한테 무료로 배포하고 꾸준히 피드백 받아서 업데이트
2. 외부 사람들도 사용할 수 있을 정도로 업데이트 된다면 앱이나 프로그램을 따로 출시하고 수익 창출 또는 장학금 받고 학교에 판매
   (단, 발생한 수익의 일부는 운영 자금으로 쓰이고 나머지는 불우한 이웃을 위해 기부금으로 사용)

[보고 공부할 유튜브 영상 또는 사이트]

Selenium으로 홈페이지 맘대로 주무르기: https://www.youtube.com/watch?v=_gkhgS33QIc&list=PLZOm4uzWk9WMF9P44dZeS9KSGOETdy515&index=6

PYAUTOGUI로 네이버 로그인 해보기: https://www.youtube.com/watch?v=GfFzW9jt_GI&list=PLZOm4uzWk9WMF9P44dZeS9KSGOETdy515&index=2

<hr>

#### readme 작성관련 참고하기 [바로가기](https://heropy.blog/2017/09/30/markdown/)



